#include <iostream>
#include <locale.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int a1, a2, a3, a4, a5, a6, s, ndfl, sred, pv;

    cout << "Введите заработную плату за первый месяц: ";
    cin >> a1;

    cout << "Введите заработную плату за второй месяц: ";
    cin >> a2;

    cout << "Введите заработную плату за третий месяц: ";
    cin >> a3;

    cout << "Введите заработную плату за четвёртый месяц: ";
    cin >> a4;

    cout << "Введите заработную плату за пятый месяц: ";
    cin >> a5;

    cout << "Введите заработную плату за шестой месяц: ";
    cin >> a6;

    s = a1 + a2 + a3 + a4 + a5 + a6;
    cout << "Итоговая заработная плата за шесть месяцев: " << s << "\n";

    ndfl = s / 13;
    cout << "Подсчёт НДФЛ итоговой заработной платы: " << ndfl << "\n";

    sred = (a1 + a2 + a3 + a4 + a5 + a6) / 6;
    cout << "Средняя заработная плата за шесть месяцев: " << sred << "\n";

    pv = s / 100;
    cout << "1 % от итоговой заработной платы: " << pv << "\n";
}