#include <iostream>
#include <string>
#include <locale.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int a, count;
Found:
    cout << "Введите количество циклов: ";
    cin >> count;
    while (count)
    {
        cout << "Введите число: ";
        cin >> a;
        cout << "Ваше число: ";
        if (a < 0) cout << "Минусовое число";
        if (a > 9999)
        {
            cout << "Вне диапазона" << endl;
            goto Found;
        }
        if (a > 1000)
        {
            string s1[9] = { "одна тысяча " , "две тысячи " , "три тысячи " , "четыре тысячи " ,"пять тысяч " , "шесть тысяч " , "семь тысяч " , "восемь тысяч " , "девять тысяч " };
            cout << s1[a / 1000 - 1];
        }

        if (a > 100)
        {
            string s2[9] = { "сто " ,"двести " ,"триста " ,"четыреста " ,"пятьсот " , "шестьсот " ,"семьсот " ,"восемьсот " ,"девятьсот " };
            cout << s2[(a / 100) % 10 - 1];
        }

        if (a > 10)
        {

            string s3[8] = { "двадцать " ,"тридцать " ,"сорок " ,"пятьдесят " , "шестьдесят " ,"семьдесят " ,"восемьдесят " ,"девяносто " };
            cout << s3[(a % 100) / 10 - 2];
        }

        if (a % 100 >= 10 && a % 100 < 20)
        {
            string s[10] = { "десять рублей" ,"одинадцать рублей" ,"двенадцать рублей" ,"тринадцать рублей" ,"четырнадцать рублей" ,"пятнадцать рублей" ,"шестнадцать рублей" ,"семнадцать рублей" ,"восемнадцать рублей" ,"девятнадцать рублей" };
            cout << s[a % 100 - 10] << endl;
        }
        else
        {
            string s[10] = { "рублей" ,"один рубль" ,"два рубля" ,"три рубля" ,"четыре рубля" ,"пять рублей" ,"шесть рублей" , "семь рублей" ,"восемь рублей" ,"девять рублей" };
            cout << s[a % 10] << endl;
        }
    }
    return 0;
}
